test/tests/timesteppers/foam_controlled_tstep_insert/buoyantCavity/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
630
(
0.423711853436544
0.423711853436544
0.423711853436544
0.423711853436544
0.423711853436544
0.423711853436544
0.423711853436544
1.27113556029508
...
)
;

boundaryField
{
    topAndBottom
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
42
(
0
0
0
0
0
0
0
0
...
)
;
    }
    frontAndBack
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
420
(
0.423711853436544
1.27113556029508
2.11855926715361
2.9659829740267
3.81340668088524
4.66083038775832
5.50825409461686
6.35567780147539
...
)
;
    }
    hot
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
90
(
0.403403974181856
1.21021192256012
2.01701987092383
2.8238278193021
3.63063576766581
4.43744371604407
5.24425166440778
6.05105961278605
...
)
;
    }
    cold
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
90
(
0.430843564303359
1.29253069292463
2.1542178215459
3.01590495016717
3.87759207877389
4.73927920739516
5.60096633601643
6.4626534646377
...
)
;
    }
}


// ************************************************************************* //
